ruby/app/models/user.rb

  def self.import(file)
    CSV.foreach(file.path, headers: true) do |row|
      #User.create!(fabricante: row[0], modelo: row[1], cor: row[2], plano: row[3], quantidade: row[4], preco: row[5])
      user = User.new(fabricante: row[0], modelo: row[1], cor: row[2], plano: row[3], quantidade: row[4], preco: row[5])

      return false unless user.valid?

      user.save
---
INSERT INTO "users" ("fabricante", "modelo", "cor", "plano", "quantidade", "preco", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def self.search(search)
---
SELECT "users".* FROM "users"