ruby/app/controllers/users_controller.rb

  def show
    if params[:search]
      @users = User.search(params[:search].capitalize)
    else
      @users = User.all
---
SELECT "users".* FROM "users" WHERE (fabricante LIKE '%vermelho%' OR modelo LIKE '%vermelho%' OR cor LIKE '%vermelho%' OR plano LIKE '%vermelho%' OR quantidade LIKE '%vermelho%' OR preco LIKE '%vermelho%')
SELECT "users".* FROM "users" WHERE (fabricante LIKE '%vermelho%' OR modelo LIKE '%vermelho%' OR cor LIKE '%vermelho%' OR plano LIKE '%vermelho%')